<h1>Selecting data in a dataFrame</h1>

**pandas** is a popular library for data analysis built on top of the python programming language. It generally provide two data structures for manipulating.
- dataFrame
- Series

A **DataFrame** is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

    A Pandas DataFrame will be created by loading the datasets from existing storage.
    Storage can be SQL Database, CSV file, Excel file, etc.
    It can also be created from the lists, dictionaries, and from a list of dictionaries.

**Series** represents a one-dimensional array of indexed data. It has two main components :

    An array of actual data.
    An associated array of indexes or data labels.

The index is used to access individual data values. You can also get a column of a dataframe as a Series. You can think of a Pandas series as a 1-D dataframe.

In [1]:
import pandas as pd

In [10]:
# Create a dataframe out of a dictionnary

# Define the dictionnary

X = {
    'Name' : ['Rose', 'Jhon', 'Jane', 'Mary'], 
    'ID' : [1, 2, 3, 4],
    'Department' : ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'],
    'Salary' : [100000, 80000, 50000, 60000]
}

# Casting the dictionnary to a dataframe
df = pd.DataFrame(X)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  Jhon   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [11]:
# Retrieve the id columns and assign it to y 
y = df['ID']
y

0    1
1    2
2    3
3    4
Name: ID, dtype: int64

In [12]:
# check the type of X
type(y)

pandas.core.series.Series

In [14]:
# Retrieve Name, Department and Salary to assign it to z
z = df[['Name', 'Department','Salary']]
z

   Name       Department  Salary
0  Rose  Architect Group  100000
1  Jhon   Software Group   80000
2  Jane      Design Team   50000
3  Mary   Infrastructure   60000

In [20]:
# create a new  dictionnary

class_student = {
    'Student' : ['David', 'Samuel', 'Terry', 'Evan'],
    'Age': [27, 24, 22,32],
    'Course': ['Python', 'Data Structures', 'machine Learning', 'Web Development'],
    'Marks': [85, 72, 889, 76]
}

# Create student dataframe
df = pd.DataFrame(class_student)
df

  Student  Age            Course  Marks
0   David   27            Python     85
1  Samuel   24   Data Structures     72
2   Terry   22  machine Learning    889
3    Evan   32   Web Development     76

In [21]:
# Retrieve marks columns to assign it to b
b = df['Marks']
b

0     85
1     72
2    889
3     76
Name: Marks, dtype: int64

In [22]:
# Get the Student column as a series Object
C = df['Student']
C

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [23]:
type(C)

pandas.core.series.Series

In [24]:
C = df[['Student']]
type(C)

pandas.core.frame.DataFrame

**loc** and **iloc** functions

- **loc()** is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select
- **iloc()** is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column

In [33]:
# df.iloc[0,0] # print the first element (0,0), first ligne , first column
df.iloc[[0,3]] # pritn out the first line and the third

  Student  Age           Course  Marks
0   David   27           Python     85
3    Evan   32  Web Development     76

In [36]:
# Access the column using the name
df.loc[0,'Course']

'Python'

In [38]:
# create a new dataframe called 'df2' set the "Name" column as an index column using the method set_index().

df2 =df
df2 = df2.set_index("Student")

In [39]:
df2.head()

         Age            Course  Marks
Student
David     27            Python     85
Samuel    24   Data Structures     72
Terry     22  machine Learning    889
Evan      32   Web Development     76

In [41]:
df2.loc['Samuel','Course']

'Data Structures'

In [44]:
df2[['Age','Marks']].mean()

Age       26.25
Marks    280.50
dtype: float64

In [46]:
df.describe().transpose()

       count    mean         std   min   25%   50%     75%    max
Age      4.0   26.25    4.349329  22.0  23.5  25.5   28.25   32.0
Marks    4.0  280.50  405.703093  72.0  75.0  80.5  286.00  889.0

<h1>Loading Data With Pandas</h1>

In [47]:

import urllib.request
url = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0101EN-SkillsNetwork/jupyterlite/files/Module%205/data/TopSellingAlbums.xlsx'
filename = 'TopSellingAlbums.xlsx'
urllib.request.urlretrieve(url, filename)

('TopSellingAlbums.xlsx', <http.client.HTTPMessage at 0x7fbc59f6bee0>)

In [49]:
# read file
df =pd.read_excel("TopSellingAlbums.xlsx")
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

In [51]:
# Access to the colunm lenght
df[['Length']]

     Length
0  00:42:19
1   0:42:11
2   0:42:49
3   0:57:44
4   0:46:33
5   0:43:08
6  01:15:54
7   0:40:01

In [53]:
# get the column as a series
df['Length']

0    00:42:19
1     0:42:11
2     0:42:49
3     0:57:44
4     0:46:33
5     0:43:08
6    01:15:54
7     0:40:01
Name: Length, dtype: object

In [54]:
x = df[['Artist']]
x

            Artist
0  Michael Jackson
1            AC/DC
2       Pink Floyd
3  Whitney Houston
4        Meat Loaf
5           Eagles
6         Bee Gees
7    Fleetwood Mac

In [55]:
type(x)

pandas.core.frame.DataFrame